import React from "react";
import '../styles/main.css'

const Main = () => {
    return (
        <div className="back" style={{height: window.innerHeight - 100}}>
            <h2 className="titleMain">Лабораторные работы по дисциплине Базы Данных</h2>
            <div className="why-learn">
                <h2 className="titleContent">Зачем изучать SQL</h2>
                <p className="why-study">
                    Понимание языка запросов SQL необходимо всем, кто&nbsp;работает с&nbsp;большими объемами данных. 
                    <br/>
                    Каждое серьезное собеседование у&nbsp;IT-специалистов содержит вопросы о&nbsp;базах данных и&nbsp;SQL.
                    <br/>
                </p>
                <p className="why-study">
                Лабораторный практикум направлен на приобретение навыков разработки баз данных,
                <br/>
                создания пользовательских SQL-запросов в среде СУБД PosgtresSQL.
                </p>
            </div>
            <div className="what-get">
                <h2 className="what-get-title">Чему научитесь</h2>
                <ul className="what-get-ul">
                    <li className="what-get-li">
                        <svg viewBox="0 0 24 24" style={{width:"30px",height:"30px"}} role="presentation">
                            <path d="M16.1263 7.32816C16.5572 6.88827 17.2498 6.89097 17.6775 7.33421C18.1056 7.77788 18.1078 8.49654 17.6823 8.94293L10.3271 16.6597C9.88051 17.1283 9.1454 17.1106 8.72024 16.621L5.28208 12.6619C4.87074 12.1882 4.9145 11.4569 5.37917 11.0396C5.83009 10.6345 6.51047 10.6765 6.91185 11.1341L9.11719 13.6482C9.32821 13.8888 9.68997 13.8991 9.91346 13.6709L16.1263 7.32816Z" style={{fill:"#1267CEff"}}></path>
                        </svg>
                        <p>Писать простые SQL запросы<br/> для получения данных</p>
                    </li>
                    <li className="what-get-li">
                        <svg viewBox="0 0 24 24" style={{width:"30px",height:"30px"}} role="presentation">
                            <path d="M16.1263 7.32816C16.5572 6.88827 17.2498 6.89097 17.6775 7.33421C18.1056 7.77788 18.1078 8.49654 17.6823 8.94293L10.3271 16.6597C9.88051 17.1283 9.1454 17.1106 8.72024 16.621L5.28208 12.6619C4.87074 12.1882 4.9145 11.4569 5.37917 11.0396C5.83009 10.6345 6.51047 10.6765 6.91185 11.1341L9.11719 13.6482C9.32821 13.8888 9.68997 13.8991 9.91346 13.6709L16.1263 7.32816Z" style={{fill:"#1267CEff"}}></path>
                        </svg>
                        <p>Работать с данными из нескольких<br/> таблиц</p>
                    </li>
                    <li className="what-get-li">
                        <svg viewBox="0 0 24 24" style={{width:"30px",height:"30px"}} role="presentation">
                            <path d="M16.1263 7.32816C16.5572 6.88827 17.2498 6.89097 17.6775 7.33421C18.1056 7.77788 18.1078 8.49654 17.6823 8.94293L10.3271 16.6597C9.88051 17.1283 9.1454 17.1106 8.72024 16.621L5.28208 12.6619C4.87074 12.1882 4.9145 11.4569 5.37917 11.0396C5.83009 10.6345 6.51047 10.6765 6.91185 11.1341L9.11719 13.6482C9.32821 13.8888 9.68997 13.8991 9.91346 13.6709L16.1263 7.32816Z" style={{fill:"#1267CEff"}}></path>
                        </svg>
                        <p>Фильтровать и сортировать <br/>строки данных</p>
                    </li>
                    <li className="what-get-li">
                        <svg viewBox="0 0 24 24" style={{width:"30px",height:"30px"}} role="presentation">
                            <path d="M16.1263 7.32816C16.5572 6.88827 17.2498 6.89097 17.6775 7.33421C18.1056 7.77788 18.1078 8.49654 17.6823 8.94293L10.3271 16.6597C9.88051 17.1283 9.1454 17.1106 8.72024 16.621L5.28208 12.6619C4.87074 12.1882 4.9145 11.4569 5.37917 11.0396C5.83009 10.6345 6.51047 10.6765 6.91185 11.1341L9.11719 13.6482C9.32821 13.8888 9.68997 13.8991 9.91346 13.6709L16.1263 7.32816Z" style={{fill:"#1267CEff"}}></path>
                        </svg>
                        <p>Объединять, пересекать<br/> и исключать наборы строк</p>
                    </li>
                    <li className="what-get-li" >
                        <svg viewBox="0 0 24 24" style={{width:"30px",height:"30px"}} role="presentation">
                            <path d="M16.1263 7.32816C16.5572 6.88827 17.2498 6.89097 17.6775 7.33421C18.1056 7.77788 18.1078 8.49654 17.6823 8.94293L10.3271 16.6597C9.88051 17.1283 9.1454 17.1106 8.72024 16.621L5.28208 12.6619C4.87074 12.1882 4.9145 11.4569 5.37917 11.0396C5.83009 10.6345 6.51047 10.6765 6.91185 11.1341L9.11719 13.6482C9.32821 13.8888 9.68997 13.8991 9.91346 13.6709L16.1263 7.32816Z" style={{fill:"#1267CEff"}}></path>
                        </svg>
                        <p>Использовать подзапросы</p>
                    </li>
                    <li className="what-get-li">
                        <svg viewBox="0 0 24 24" style={{width:"30px",height:"30px"}} role="presentation">
                            <path d="M16.1263 7.32816C16.5572 6.88827 17.2498 6.89097 17.6775 7.33421C18.1056 7.77788 18.1078 8.49654 17.6823 8.94293L10.3271 16.6597C9.88051 17.1283 9.1454 17.1106 8.72024 16.621L5.28208 12.6619C4.87074 12.1882 4.9145 11.4569 5.37917 11.0396C5.83009 10.6345 6.51047 10.6765 6.91185 11.1341L9.11719 13.6482C9.32821 13.8888 9.68997 13.8991 9.91346 13.6709L16.1263 7.32816Z" style={{fill:"#1267CEff"}}></path>
                        </svg>
                        <p>Выполнять математические операции</p>
                    </li>
                </ul>
         
            </div>
        </div>       
    )
}

export default Main;